Revit 2027 API
ExternalServices.BuiltInExternalServices.ExtendedPropertiesUIService Property
 The external UI service which permits registration of an alternate servers for new UI of link extended properties
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalServiceId ExtendedPropertiesUIService { get; }
Public Shared ReadOnly Property ExtendedPropertiesUIService As ExternalServiceId
	Get
public:
static property ExternalServiceId^ ExtendedPropertiesUIService {
	ExternalServiceId^ get ();
}
static member ExtendedPropertiesUIService : ExternalServiceId with get
Property Value
ExternalServiceId
See Also
Reference
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace